Documents/ЗаказНаРаботу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ЗаказНаРаботу</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Работы</xr:Item>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеТехническогоЗадания</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конфигурация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Конфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗатратыВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗаказа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПремияШтраф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыОплатыЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОплатыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заметки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заметка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СчетНаОплату.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>СчетНаОплату</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаРаботу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатусыЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗатратыВремени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗаказа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаказНаРаботу/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура НачатьРаботу(Команда)

	СсылкаНаЗаказ = Элементы.Список.ТекущаяСтрока;
	
	Если Не ЗначениеЗаполнено(СсылкаНаЗаказ) ИЛИ НЕ ТипЗнч(СсылкаНаЗаказ) = Тип("ДокументСсылка.ЗаказНаРаботу") Тогда
		Возврат
	КонецЕсли;
	
	ИзменитьСтатусТекущейСтроки(СсылкаНаЗаказ, ПредопределенноеЗначение("Справочник.СтатусыЗадач.ВРаботе"));
	
	Элементы.Список.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура ПередатьНаПроверку(Команда)
	
	СсылкаНаЗаказ = Элементы.Список.ТекущаяСтрока;
	
	Если Не ЗначениеЗаполнено(СсылкаНаЗаказ) ИЛИ НЕ ТипЗнч(СсылкаНаЗаказ) = Тип("ДокументСсылка.ЗаказНаРаботу") Тогда
		Возврат
	КонецЕсли;
	
	ИзменитьСтатусТекущейСтроки(СсылкаНаЗаказ, ПредопределенноеЗначение("Справочник.СтатусыЗадач.НаПроверке"));
	
	Элементы.Список.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура Завершить(Команда)
	
	СсылкаНаЗаказ = Элементы.Список.ТекущаяСтрока;
	
	Если Не ЗначениеЗаполнено(СсылкаНаЗаказ) ИЛИ НЕ ТипЗнч(СсылкаНаЗаказ) = Тип("ДокументСсылка.ЗаказНаРаботу") Тогда
		Возврат
	КонецЕсли;

	
	ИзменитьСтатусТекущейСтроки(СсылкаНаЗаказ, ПредопределенноеЗначение("Справочник.СтатусыЗадач.Выполнена"));
	
	Элементы.Список.Обновить();
	
КонецПроцедуры


Процедура ИзменитьСтатусТекущейСтроки(Ссылка, Статус);
	
	ДокументОбъект = Ссылка.ПолучитьОбъект();
	ДокументОбъект.Статус = Статус;
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		ВывестиИнформацияПоЗадаче(ТекущаяСтрока);
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаСервере
Процедура ВывестиИнформацияПоЗадаче(Ссылка);
	
	Если ЗначениеЗаполнено(Ссылка.Проект) И ТИПЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказНаРаботу") Тогда
		
		ТекстЗадачи = Ссылка.ХранилищеТехническогоЗадания.Получить();
		Заказчик = Ссылка.Заказчик;
		НормаВремени = Ссылка.ЗатратыВремени;
		Сумма = Ссылка.СуммаЗаказа;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСчетНаОплатуНаСервере(ВыделенныеСтроки)
	
	НовыйДокумент = Документы.СчетНаОплату.СоздатьДокумент();
	НовыйДокумент.Контрагент = ВыделенныеСтроки[0].Заказчик;
	НовыйДокумент.Дата = ТекущаяДата();
	
	Для Каждого ОбъектМассива Из ВыделенныеСтроки Цикл
		
		НовыйДокументСтрока = НовыйДокумент.Документы.Добавить();
		НовыйДокументСтрока.Заказ = ОбъектМассива;
		ЗаполнитьЗначенияСвойств(НовыйДокументСтрока, ОбъектМассива);
		
	КонецЦикла;
	
	НовыйДокумент.Записать();
		
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСчетНаОплату(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	СформироватьСчетНаОплатуНаСервере(ВыделенныеСтроки);
	
КонецПроцедуры
